### IMPORT MODULES

In [4]:
import sqlalchemy
from sqlalchemy import create_engine
import pandas as pd

## create an engine to connect to the db

In [8]:
engine = create_engine('sqlite:///data/raw_data_project_m1.db')

## query to select the table we are interested in

group by the column we are interested in

In [9]:
pd.read_sql_query("select * from country_info group by rural", engine)

                                   uuid country_code        rural
0  15626d40-db13-0133-ea5c-0a81e8b09a82           AT      Country
1  d468c670-da40-0133-de39-0a81e8b09a82           AT    Non-Rural
2  83127080-da3d-0133-c74f-0a81e8b09a82           AT         city
3  f6e7ee00-deac-0133-4de8-0a81e8b09a82           AT  countryside
4  0f286c80-dd77-0133-7803-0a81e8b09a82           AT        rural
5  54f0f1c0-dda1-0133-a559-0a81e8b09a82           AT        urban

## Changing rural column

We need to change Non-Rural/city to urban and Country/countryside to rural

In [24]:
pd.read_sql_query("select replace (replace (replace (replace (rural, 'Country', 'rural'), 'countryside', 'rural'), 'Non-Rural', 'urban'), 'city', 'urban') AS 'rural' from country_info", engine)

      rural
0     rural
1     urban
2     urban
3     rural
4     urban
...     ...
9644  urban
9645  urban
9646  urban
9647  urban
9648  urban

[9649 rows x 1 columns]